{"backend": "tensorflow", "config": [{"config": {"dilation_rate": [1, 1], "name": "conv2d_1", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "batch_input_shape": [null, 200, 200, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_2", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_3", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "units": 128, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "softmax", "units": 176, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5"}